[
  {
    "name": "Express Yourself with Custom Colors",
    "description": "Choose your own text color to make every lyric and note feel uniquely yours. Stand out with a personal touch across your recordings."
  },
  {
    "name": "Switch Between Light and Dark Mode",
    "description": "Enjoy the flexibility of light or dark mode with a single tap. Create in the mode that feels just right, day or night."
  },
  {
    "name": "Smooth Start with a Splash",
    "description": "Experience a welcoming splash screen that sets the stage for creativity, complete with a progress indicator for a seamless entry."
  },
  {
    "name": "Guided Onboarding Walkthrough",
    "description": "Start off right with a 4-step guided tour that smoothly introduces you to Lyric Drop’s core features, powered by Framer Motion animations."
  },
  {
    "name": "Record Anywhere, Anytime",
    "description": "Lyric Drop is designed for every screen size. Whether you’re on a phone or tablet, capture your music wherever inspiration strikes."
  },
  {
    "name": "State Management for an Effortless Experience",
    "description": "Enjoy a smooth, intuitive experience with refined state management that keeps all your preferences and settings right at your fingertips."
  },
  {
    "name": "Enhanced Styling for Your Theme",
    "description": "Lyric Drop’s updated styling effortlessly adapts to your chosen theme and colors, creating a consistent, sleek interface no matter your preference."
  },
  {
    "name": "Accessibility-First Design",
    "description": "Your app, accessible to all. Lyric Drop includes enhanced ARIA labels and interactive elements for an inclusive experience."
  },
  {
    "name": "Customize Your Creative Space",
    "description": "Take control of your recording environment with flexible theme, color, and style options. Lyric Drop gives you the tools to create without limits."
  },
  {
    "name": "Seamless Recording with Zero Interruptions",
    "description": "Record your music smoothly with an app that’s designed to minimize distractions and keep you in the flow. Lyric Drop is all about uninterrupted creativity."
  },
  {
    "name": "Fast and Flexible Theme Switching",
    "description": "With just a tap, switch between light and dark modes without missing a beat. Customize your workspace instantly to match your vibe."
  },
  {
    "name": "Personalize Your Journey",
    "description": "From onboarding to recording, Lyric Drop tailors your experience to fit your style, giving you complete control over every detail along the way."
  }
]
